[
  {
    "id": "project1",
    "title": "The World Wide Recipe: A Community-Centred Framework for Fine-Grained Data Collection and Regional Bias Operationalisation",
    "description": "A framework for culturally aware, community-centred data collection and the World Wide Dishes evaluation dataset comprising 765 unique dishes across 106 countries in 131 local languages. We analyse how T2I models underperform across accuracy, representation, and cultural sensitivity dimensions. Models produce inaccurate and culturally misrepresentative outputs even for well-resourced regions such as the US, with worse performance for African countries. Over 50% of community-sourced dishes didn't exist in web-scraped datasets, proving the limits of automated scraping.",
    "authors": ["Jabez Magomere", "Shu Ishida", "Tejumade Afonja", "Aya Salama", "Daniel Kochin", "Foutse Yuehgoh", "Imane Hamzaoui", "Raesetje Sefala", "Aisha Alaagib", "Samantha Dalal", "Beatrice Marchegiani", "Elizaveta Semenova", "Lauren Crais", "Siobhan Mackenzie Hall"],
    "venue": "ACM FAccT 2025 (Best Paper Honourable Mention)",
    "paperURL": "https://dl.acm.org/doi/10.1145/3715275.3732019"
  },
  {
    "id": "project2",
    "title": "VisoGender: A Dataset for Benchmarking Gender Bias in Image-Text Pronoun Resolution",
    "description": "A dataset for benchmarking gender bias in vision-language models, focusing on occupation-related biases within binary gender presentation. Inspired by Winogender schemas, VisoGender evaluates resolution bias (pronoun resolution accuracy differences) and retrieval bias (gender presentation ratios in search results). Benchmarking state-of-the-art models reveals bias in resolving binary gender in complex scenes, with captioning models generally less biased than Vision-Language Encoders.",
    "authors": ["Siobhan Mackenzie Hall", "Fernanda Gonçalves Abrantes", "Hanwen Zhu", "Grace Sodunke", "Aleksandar Shtedritski", "Hannah Rose Kirk"],
    "venue": "NeurIPS 2023",
    "paperURL": "https://arxiv.org/abs/2306.12424"
  },
  {
    "id": "project3",
    "title": "A Prompt Array Keeps the Bias Away: Debiasing Vision-Language Models with Adversarial Learning",
    "description": "Vision-language models encode societal biases, but measuring and mitigating these harms is challenging due to lacking robustness and feature degradation. We apply ranking metrics for image-text representations and show that learned embeddings prepended to text queries—jointly trained with adversarial debiasing and contrastive loss—reduce various bias measures with minimal degradation to image-text representation.",
    "authors": ["Hugo Berg", "Siobhan Mackenzie Hall", "Yash Bhalgat", "Wonsuk Yang", "Hannah Rose Kirk", "Aleksandar Shtedritski", "Max Bain"],
    "venue": "AACL 2022",
    "paperURL": "https://arxiv.org/abs/2203.11933"
  },
  {
    "id": "project4",
    "title": "SMRS: Advocating a Unified Reporting Standard for Surrogate Models",
    "description": "Surrogate models approximate expensive simulations across fields from climate prediction to drug discovery, but are developed differently across disciplines, making them impossible to reproduce or compare. We introduce the Surrogate Model Reporting Specification (SMRS), a lightweight checklist capturing key design choices: data collection, model type, uncertainty handling, and performance evaluation. SMRS provides a structured reporting standard to make surrogate modeling more transparent, comparable, and trustworthy across scientific fields.",
    "authors": ["Elizaveta Semenova", "Alisa Sheinkman", "Timothy James Hitge", "Siobhan Mackenzie Hall", "Jon Cockayne"],
    "venue": "NeurIPS 2025 Position Paper",
    "paperURL": "https://arxiv.org/abs/2502.06753"
  },
  {
    "id": "project5",
    "title": "Finite Element Modelling for Biophysical Models of Cortical Stimulation: A Computational Framework",
    "description": "Methods for FEM modeling of peripheral and central nervous systems for testing cortical stimulation hypotheses and electrode designs before in vitro/in vivo experiments. We evaluate the impact of differentiation errors on calculating the Activating Function and predicting action potentials in Hodgkin-Huxley axon models. Poor spatial discretisation generates double-derivative noise, with coarser meshes requiring higher activation thresholds (57.5 mA vs 55 mA). Our findings support using the finest spatial discretizations possible within computational constraints and coupling extracellular fields to H-H-based axons.",
    "authors": ["Rodrigo Osorio L.", "Siobhan Mackenzie Hall", "Francisco Saavedra R.", "Pablo Aqueveque N.", "James J. FitzGerald", "Brian Andrews"],
    "venue": "IEEE TNSRE 2025",
    "paperURL": "https://ieeexplore.ieee.org/document/10820855"
  },
  {
    "id": "project6",
    "title": "The Human Labour of Data Work: Understanding the Challenges of Data Collection in the Global South",
    "description": "Guidance for building and maintaining infrastructure for participatory AI through reflections on World Wide Dishes (WWD), a bottom-up, community-led dataset of culinary dishes and cultural customs. WWD demonstrates participatory dataset creation where community members guide research design and contribute to crowdsourcing, incorporating localized expertise to address limitations of web-scraped Internet datasets acknowledged in Participatory AI discourse.",
    "authors": ["Siobhan Mackenzie Hall", "Samantha Dalal", "Raesetje Sefala", "Foutse Yuehgoh", "Aisha Alaagib", "Imane Hamzaoui", "Shu Ishida", "Jabez Magomere", "Lauren Crais", "Aya Salama", "Tejumade Afonja"],
    "venue": "CSCW 2025",
    "paperURL": "https://dl.acm.org/doi/10.1145/3757673"
  }
]
