[
  {
    "id": "project1",
    "title": "The World Wide Recipe: A Community-Centred Framework for Fine-Grained Data Collection and Regional Bias Operationalisation",
    "description": "The World Wide Recipe sets forth a framework for culturally aware and participatory data collection, and the resultant regionally diverse World Wide Dishes evaluation dataset. We also analyse bias operationalisation to highlight how current systems underperform across several dimensions: (in-)accuracy, (mis-)representation, and cultural (in-)sensitivity, with evidence from qualitative community-based observations and quantitative automated tools. We find that these T2I models generally do not produce quality outputs of dishes specific to various regions. This is true even for the US, which is typically considered more well-resourced in training data—although the generation of US dishes does outperform that of the investigated African countries. The models demonstrate the propensity to produce inaccurate and culturally misrepresentative, flattening, and insensitive outputs. These representational biases have the potential to further reinforce stereotypes and disproportionately contribute to erasure based on region. The dataset and code are available at https://github.com/oxai/world-wide-dishes. The dataset comprises 765 unique dishes across 106 countries, with names in 131 local languages. Over 50% of community-sourced dishes did not exist in comparable web-scraped datasets, proving the limits of automated scraping.",
    "authors": ["Jabez Magomere", "Shu Ishida", "Tejumade Afonja", "Aya Salama", "Daniel Kochin", "Foutse Yuehgoh", "Imane Hamzaoui", "Raesetje Sefala", "Aisha Alaagib", "Samantha Dalal", "Beatrice Marchegiani", "Elizaveta Semenova", "Lauren Crais", "Siobhan Mackenzie Hall"],
    "venue": "ACM FAccT 2025 (Best Paper Honourable Mention)",
    "paperURL": "https://dl.acm.org/doi/10.1145/3715275.3732019"
  },
  {
    "id": "project2",
    "title": "VisoGender: A Dataset for Benchmarking Gender Bias in Image-Text Pronoun Resolution",
    "description": "We introduce VisoGender, a novel dataset for benchmarking gender bias in vision-language models. We focus on occupation-related biases within a hegemonic system of binary gender, inspired by Winograd and Winogender schemas, where each image is associated with a caption containing a pronoun relationship of subjects and objects in the scene. VisoGender is balanced by gender representation in professional roles, supporting bias evaluation in two ways: i) resolution bias, where we evaluate the difference between pronoun resolution accuracies for image subjects with gender presentations perceived as masculine versus feminine by human annotators and ii) retrieval bias, where we compare ratios of professionals perceived to have masculine and feminine gender presentations retrieved for a gender-neutral search query. We benchmark several state-of-the-art vision-language models and find that they demonstrate bias in resolving binary gender in complex scenes. While the direction and magnitude of gender bias depends on the task and the model being evaluated, captioning models are generally less biased than Vision-Language Encoders.",
    "authors": ["Siobhan Mackenzie Hall", "Fernanda Gonçalves Abrantes", "Hanwen Zhu", "Grace Sodunke", "Aleksandar Shtedritski", "Hannah Rose Kirk"],
    "venue": "NeurIPS 2023",
    "paperURL": "https://arxiv.org/abs/2306.12424"
  },
  {
    "id": "project3",
    "title": "A Prompt Array Keeps the Bias Away: Debiasing Vision-Language Models with Adversarial Learning",
    "description": "Proposed an adversarial learning framework to debias vision-language models without large-scale retraining. Used frozen CLIP encoders with learnable prompt tokens and multi-layer perceptron adversaries. Jointly optimised adversarial loss and image-text contrastive loss, achieving less than 1% drop in zero-shot ImageNet accuracy whilst reducing bias. Discovered that standard NLP bias metrics (WEAT) were mathematically brittle in multimodal contexts.",
    "authors": ["Hugo Berg", "Siobhan Mackenzie Hall", "Yash Bhalgat", "Wonsuk Yang", "Hannah Rose Kirk", "Aleksandar Shtedritski", "Max Bain"],
    "venue": "AACL 2022",
    "paperURL": "https://arxiv.org/abs/2203.11933"
  },
  {
    "id": "project4",
    "title": "SMRS: Advocating a Unified Reporting Standard for Surrogate Models",
    "description": "Scientific and engineering problems, from climate prediction to drug discovery, often depend on surrogate models: simplified, data-driven models that approximate expensive simulations or experiments. These surrogates save enormous amounts of time and computation but are developed in very different ways across disciplines. As a result, it is often impossible to reproduce, compare, or reuse them, even when code and data are available. This paper argues that the field needs a shared way to report how surrogate models are built, trained, and tested. We introduce the Surrogate Model Reporting Specification (SMRS), a lightweight checklist that captures key design choices, such as how data were collected, what type of model was used, how uncertainty was handled, and how performance was evaluated. SMRS is not a new algorithm; it is a structured way to describe existing ones so that other researchers can understand and replicate them. By introducing a consistent reporting standard, we aim to make surrogate modelling more transparent, comparable, and trustworthy, ultimately accelerating progress across many scientific fields in the age of artificial intelligence.",
    "authors": ["Elizaveta Semenova", "Alisa Sheinkman", "Timothy James Hitge", "Siobhan Mackenzie Hall", "Jon Cockayne"],
    "venue": "NeurIPS 2025 Position Paper",
    "paperURL": "https://arxiv.org/abs/2502.06753"
  },
  {
    "id": "project5",
    "title": "Finite Element Modelling for Biophysical Models of Cortical Stimulation: A Computational Framework",
    "description": "Developed a comprehensive modelling pipeline coupling finite element modelling (COMSOL) with biophysical neuron modelling (NEURON/Python) to optimise electrode geometry for brain mapping. Implemented adaptive meshing to resolve high-gradient areas near electrodes whilst saving computational resources. Built surrogate models using artificial neural networks in PyTorch to predict neural activation, significantly reducing computational demands compared to full biophysical simulations.",
    "authors": ["Rodrigo Osorio L.", "Siobhan Mackenzie Hall", "Francisco Saavedra R.", "Pablo Aqueveque N.", "James J. FitzGerald", "Brian Andrews"],
    "venue": "IEEE TNSRE 2025",
    "paperURL": "https://ieeexplore.ieee.org/document/10820855"
  },
  {
    "id": "project6",
    "title": "The Human Labour of Data Work: Understanding the Challenges of Data Collection in the Global South",
    "description": "Investigates the human labour involved in data collection processes, particularly focusing on challenges faced by communities in the Global South. Examines the intersection of responsible AI, data diversity, and the often-invisible work of data contributors. Highlights the need for ethical data collection practices that centre community voices and ensure fair compensation for data labour.",
    "authors": ["Siobhan Mackenzie Hall", "Samantha Dalal", "Raesetje Sefala", "Foutse Yuehgoh", "Aisha Alaagib", "Imane Hamzaoui", "Shu Ishida", "Jabez Magomere", "Lauren Crais", "Aya Salama", "Tejumade Afonja"],
    "venue": "CSCW 2025",
    "paperURL": "https://dl.acm.org/doi/10.1145/3757673"
  }
]
